## Data in Motion Pandas Challenge Week 11

In [1]:
import pandas as pd
import json

#### Read in the JSON file.

In [2]:
df = pd.read_json('nested_list.json')

In [3]:
df.head()

,school_name,class,students
0,ABC primary school,Year 1,"{'id': 'A001', 'name': 'Tom', 'math': 60, 'phy..."
1,ABC primary school,Year 1,"{'id': 'A002', 'name': 'James', 'math': 89, 'p..."
2,ABC primary school,Year 1,"{'id': 'A003', 'name': 'Jenny', 'math': 79, 'p..."

#### Flatten the nested list from JSON object.

In [4]:
df2=pd.json_normalize(df.students)

In [5]:
df2.head()

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

#### Create a dataframe that includes the flatten list and all original columns

In [6]:
dfAll=df2.copy()

In [7]:
dfAll['school_name']=df.school_name

In [8]:
dfAll['class']=df['class']

In [9]:
dfAll.head()

     id   name  math  physics  chemistry         school_name   class
0  A001    Tom    60       66         61  ABC primary school  Year 1
1  A002  James    89       76         51  ABC primary school  Year 1
2  A003  Jenny    79       90         78  ABC primary school  Year 1